function Hero() {
  return (
    <div className="hero">
      <h1>Ekvisa</h1>
      <h2>Обо мне</h2>
      <p>
        Люблю задачи, в которых встречаются логика и творчество. <br />
        Мне нравится разбираться в том, как устроены вещи, изучать новые
        технологии и превращать идеи в работающие проекты.
        <br />
        Сейчас изучаю современный frontend, TypeScript и возможности
        AI-инструментов в разработке.
        <br />
      </p>
      <h2>Как я работаю</h2>
      <p>
        Стараюсь делать проекты интересными и полезными.
        <br />
        Продумываю архитектуру и логику.
        <br />
        Использую ИИ как инструмент и помощника.
        <br />
      </p>
      <h2>Кейсы</h2>
      <p>
        Проекты:{" "}
        <a href="https://github.com/Ekvisa">https://github.com/Ekvisa</a>
      </p>

      <h2>Контакты</h2>
      <p>
        ✉️ <a href="mailto:">katishh@gmail.com</a>
        <br />
        💬 <a href="https://t.me/@ek_pike">@ek_pike</a>
      </p>
    </div>
  );
}

export default Hero;
